// Напишите программу, которая принимает на вход числа через цикл (в случае пустой строки ввод прекращается) 
// и проверяет находятся ли там квадраты чисел каждого к каждому. И если да, выводит какое именно число является квадратом какого.
// сначала пользователь пишет сколько чисел введе

Console.WriteLine("Введите первое целое число:");
int num1 = Convert.ToInt32 (Console.ReadLine());