// Напишите программу, которая выводит случайное число и удаляет вторую цифру этого числа.


// Console.WriteLine("Сгенерировано случайное число ");
// int numA = new Random().Next(numA);
// int numB = Convert.ToInt32(Console.ReadLine());
// int d = numA % 10;
// int n = numA / n;
// Console.WriteLine();